app/controllers/customers_controller.rb

  def select

    if params[:type] == 1.to_s
      @obj = Customer.where('market = ? and status = ?', params[:market], false).first
    else
      @obj = Account.where('market = ? and status = ?', params[:market], false).first
    end

    @refno = ''

    if(@obj != nil)

      @obj.status = true
      @obj.save
---
SELECT  "customers".* FROM "customers" WHERE (market = 'IPO' and status = FALSE) ORDER BY "customers"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "customers" SET "status" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["status", true], ["updated_at", "2019-02-22 12:17:00.781872"], ["id", 31207]]